dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/DAC0_1.0.xml
<?xml version="1.0" encoding="UTF-8"?>
<module id="DAC0" HW_revision="1.0">
    <register id="DAC0_FSUB_0" width="32" offset="0x400" description="Subscriber Port 0">
        <bitfield id="CHANID" description="0 = disconnected.
others = connected to channel_ID = CHANID." begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="MNIMUM" value="0x0" description="0 is an allowed value, signifying that the event is unconnected"/>
            <bitenum id="UNCONNECTED" value="0x0" description="A value of 0 specifies that the event is not connected"/>
            <bitenum id="MAXIMUM" value="0xF" description="Consult your device datasheet as the actual allowed maximum may be less than 15."/>
        </bitfield>
    </register>
    <register id="DAC0_FPUB_1" width="32" offset="0x444" description="Publisher port 1">
        <bitfield id="CHANID" description="0 = disconnected.
others = connected to channel_ID = CHANID." begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="MNIMUM" value="0x0" description="0 is an allowed value, signifying that the event is unconnected"/>
            <bitenum id="UNCONNECTED" value="0x0" description="A value of 0 specifies that the event is not connected"/>
            <bitenum id="MAXIMUM" value="0xF" description="Consult your device datasheet as the actual allowed maximum may be less than 15."/>
        </bitfield>
    </register>
    <group id="DAC0_GPRCM" name="DAC0_GPRCM" instances="1" offset="0x800" instaddr="0x100" description="">
        <register id="DAC0_PWREN" width="32" offset="0x0" description="Power enable">
            <bitfield id="ENABLE" description="Enable the power" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disable Power"/>
                <bitenum id="ENABLE" value="0x1" description="Enable Power"/>
            </bitfield>
        </register>
        <register id="DAC0_RSTCTL" width="32" offset="0x4" description="Reset Control">
            <bitfield id="RESETSTKYCLR" description="Clear the RESETSTKY bit in the STAT register" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear reset sticky bit"/>
            </bitfield>
            <bitfield id="RESETASSERT" description="Assert reset to the peripheral" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="ASSERT" value="0x1" description="Assert reset"/>
            </bitfield>
        </register>
        <register id="DAC0_STAT" width="32" offset="0x14" description="Status Register">
            <bitfield id="RESETSTKY" description="This bit indicates, if the peripheral was reset, since this bit was cleared by RESETSTKYCLR in the RSTCTL register" begin="16" end="16" width="1" rwaccess="R">
                <bitenum id="NORES" value="0x0" description="The peripheral has not been reset since this bit was last cleared by RESETSTKYCLR in the RSTCTL register"/>
                <bitenum id="RESET" value="0x1" description="The peripheral was reset since the last bit clear"/>
            </bitfield>
        </register>
        </group>
    <group id="DAC0_CPU_INT" name="DAC0_CPU_INT" instances="1" offset="0x1020" instaddr="0x30" description="">
        <register id="DAC0_CPU_INT_IIDX" width="32" offset="0x0" description="Interrupt index">
            <bitfield id="STAT" description="Interrupt index status" begin="3" end="0" width="4" rwaccess="R">
                <bitenum id="NO_INTR" value="0x0" description="No pending interrupt"/>
                <bitenum id="MODRDYIFG" value="0x2" description="Module ready interrupt"/>
                <bitenum id="FIFOFULLIFG" value="0x9" description="FIFO full interrupt"/>
                <bitenum id="FIFO1B4IFG" value="0xA" description="FIFO one fourth empty interrupt"/>
                <bitenum id="FIFO1B2IFG" value="0xB" description="FIFO half empty interrupt"/>
                <bitenum id="FIFO3B4IFG" value="0xC" description="FIFO three fourth empty interrupt"/>
                <bitenum id="FIFOEMPTYIFG" value="0xD" description="FIFO empty interrupt"/>
                <bitenum id="FIFOURUNIFG" value="0xE" description="FIFO underrun interrupt"/>
                <bitenum id="DMADONEIFG" value="0xF" description="DMA done interrupt"/>
            </bitfield>
        </register>
        <register id="DAC0_CPU_INT_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="MODRDYIFG" description="Masks MODRDYIFG" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt is masked out"/>
                <bitenum id="SET" value="0x1" description="Interrupt will request an interrupt service routine and corresponding bit in MIS will be set"/>
            </bitfield>
            <bitfield id="FIFO1B2IFG" description="Masks FIFO1B2IFG" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt is masked out"/>
                <bitenum id="SET" value="0x1" description="Interrupt will request an interrupt service routine and corresponding bit in MIS will be set"/>
            </bitfield>
            <bitfield id="FIFOEMPTYIFG" description="Masks FIFOEMPTYIFG" begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt is masked out"/>
                <bitenum id="SET" value="0x1" description="Interrupt will request an interrupt service routine and corresponding bit in MIS will be set"/>
            </bitfield>
            <bitfield id="FIFO1B4IFG" description="Masks FIFO1B4IFG" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt is masked out"/>
                <bitenum id="SET" value="0x1" description="Interrupt will request an interrupt service routine and corresponding bit in MIS will be set"/>
            </bitfield>
            <bitfield id="FIFO3B4IFG" description="Masks FIFO3B4IFG" begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt is masked out"/>
                <bitenum id="SET" value="0x1" description="Interrupt will request an interrupt service routine and corresponding bit in MIS will be set"/>
            </bitfield>
            <bitfield id="FIFOFULLIFG" description="Masks FIFOFULLIFG" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt is masked out"/>
                <bitenum id="SET" value="0x1" description="Interrupt will request an interrupt service routine and corresponding bit in MIS will be set"/>
            </bitfield>
            <bitfield id="FIFOURUNIFG" description="Masks FIFOURUNIFG" begin="13" end="13" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt is masked out"/>
                <bitenum id="SET" value="0x1" description="Interrupt will request an interrupt service routine and corresponding bit in MIS will be set"/>
            </bitfield>
            <bitfield id="DMADONEIFG" description="Masks DMADONEIFG" begin="14" end="14" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt is masked out"/>
                <bitenum id="SET" value="0x1" description="Interrupt will request an interrupt service routine and corresponding bit in MIS will be set"/>
            </bitfield>
        </register>
        <register id="DAC0_CPU_INT_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="MODRDYIFG" description="Raw interrupt status for MODRDYIFG" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DAC module ready event did not occur"/>
                <bitenum id="SET" value="0x1" description="DAC module ready event occurred"/>
            </bitfield>
            <bitfield id="FIFOEMPTYIFG" description="Raw interrupt status for FIFOEMPTYIFG" begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="FIFO empty condition did not occur"/>
                <bitenum id="SET" value="0x1" description="FIFO empty condition occurred"/>
            </bitfield>
            <bitfield id="FIFO1B4IFG" description="Raw interrupt status for FIFO1B4IFG" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="FIFO one fourth empty condition did not occur"/>
                <bitenum id="SET" value="0x1" description="FIFO one fourth empty condition occurred"/>
            </bitfield>
            <bitfield id="FIFO1B2IFG" description="Raw interrupt status for FIFO1B2IFG" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="FIFO half empty condition did not occur"/>
                <bitenum id="SET" value="0x1" description="FIFO half empty condition occurred"/>
            </bitfield>
            <bitfield id="FIFO3B4IFG" description="Raw interrupt status for FIFO3B4IFG" begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="FIFO three fourth empty condition did not occur"/>
                <bitenum id="SET" value="0x1" description="FIFO three fourth empty condition occurred"/>
            </bitfield>
            <bitfield id="FIFOFULLIFG" description="Raw interrupt status for FIFOFULLIFG" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="FIFO full condition did not occur"/>
                <bitenum id="SET" value="0x1" description="FIFO full condition occurred"/>
            </bitfield>
            <bitfield id="FIFOURUNIFG" description="Raw interrupt status for FIFOURUNIFG" begin="13" end="13" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="FIFO underrun condition did not occur"/>
                <bitenum id="SET" value="0x1" description="FIFO underrun condition occurred"/>
            </bitfield>
            <bitfield id="DMADONEIFG" description="Raw interrupt status for DMADONEIFG" begin="14" end="14" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DMA done condition did not occur"/>
                <bitenum id="SET" value="0x1" description="DMA done condition occurred"/>
            </bitfield>
        </register>
        <register id="DAC0_CPU_INT_MIS" width="32" offset="0x18" description="Masked interrupt status">
            <bitfield id="MODRDYIFG" description="Masked interrupt status for MODRDYIFG" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="MODRDYIFG does not request an interrupt service routine"/>
                <bitenum id="SET" value="0x1" description="MODRDYIFG requests an interrupt service routine"/>
            </bitfield>
            <bitfield id="FIFOEMPTYIFG" description="Masked interrupt status for FIFOEMPTYIFG" begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="FIFOEMPTYIFG does not request an interrupt service routine"/>
                <bitenum id="SET" value="0x1" description="FIFOEMPTYIFG requests an interrupt service routine"/>
            </bitfield>
            <bitfield id="FIFO1B4IFG" description="Masked interrupt status for FIFO1B4IFG" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="FIFO1B4IFG does not request an interrupt service routine"/>
                <bitenum id="SET" value="0x1" description="FIFO1B4IFG requests an interrupt service routine"/>
            </bitfield>
            <bitfield id="FIFO1B2IFG" description="Masked interrupt status for FIFO1B2IFG" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="FIFO1B2IFG does not request an interrupt service routine"/>
                <bitenum id="SET" value="0x1" description="FIFO1B2IFG requests an interrupt service routine"/>
            </bitfield>
            <bitfield id="FIFO3B4IFG" description="Masked interrupt status for FIFO3B4IFG" begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="FIFO3B4IFG does not request an interrupt service routine"/>
                <bitenum id="SET" value="0x1" description="FIFO3B4IFG requests an interrupt service routine"/>
            </bitfield>
            <bitfield id="FIFOFULLIFG" description="Masked interrupt status for FIFOFULLIFG" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="FIFOFULLIFG does not request an interrupt service routine"/>
                <bitenum id="SET" value="0x1" description="FIFOFULLIFG requests an interrupt service routine"/>
            </bitfield>
            <bitfield id="FIFOURUNIFG" description="Masked interrupt status for FIFOURUNIFG" begin="13" end="13" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="FIFOURUNIFG does not request an interrupt service routine"/>
                <bitenum id="SET" value="0x1" description="FIFOURUNIFG requests an interrupt service routine"/>
            </bitfield>
            <bitfield id="DMADONEIFG" description="Masked interrupt status for DMADONEIFG" begin="14" end="14" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DMADONEIFG does not request an interrupt service routine"/>
                <bitenum id="SET" value="0x1" description="DMADONEIFG requests an interrupt service routine"/>
            </bitfield>
        </register>
