dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/DAC0_1.0.xml
        <register id="DAC0_CPU_INT_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="MODRDYIFG" description="Sets MODRDYIFG in RIS register" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="RIS bit corresponding to MODRDYIFG is set"/>
            </bitfield>
            <bitfield id="FIFOEMPTYIFG" description="Sets FIFOEMPTYIFG in RIS register" begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="RIS bit corresponding to FIFOEMPTYIFG is set"/>
            </bitfield>
            <bitfield id="FIFO1B4IFG" description="Sets FIFO1B4IFG in RIS register" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="RIS bit corresponding to FIFO1B4IFG is set"/>
            </bitfield>
            <bitfield id="FIFO1B2IFG" description="Sets FIFO1B2IFG in RIS register" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="RIS bit corresponding to FIFO1B2IFG is set"/>
            </bitfield>
            <bitfield id="FIFO3B4IFG" description="Sets FIFO3B4IFG in RIS register" begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="RIS bit corresponding to FIFO3B4IFG is set"/>
            </bitfield>
            <bitfield id="FIFOFULLIFG" description="Sets FIFOFULLIFG in RIS register" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="RIS bit corresponding to FIFOFULLIFG is set"/>
            </bitfield>
            <bitfield id="FIFOURUNIFG" description="Sets FIFOURUNIFG in RIS register" begin="13" end="13" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="RIS bit corresponding to FIFOURUNIFG is set"/>
            </bitfield>
            <bitfield id="DMADONEIFG" description="Sets DMADONEIFG in RIS register" begin="14" end="14" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="RIS bit corresponding to DMADONEIFG is set"/>
            </bitfield>
        </register>
        <register id="DAC0_CPU_INT_ICLR" width="32" offset="0x28" description="Interrupt clear">
            <bitfield id="MODRDYIFG" description="Clears MODRDYIFG in RIS register" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="RIS bit corresponding to MODRDYIFG is cleared"/>
            </bitfield>
            <bitfield id="FIFOEMPTYIFG" description="Clears FIFOEMPTYIFG in RIS register" begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="RIS bit corresponding to FIFOEMPTYIFG is cleared"/>
            </bitfield>
            <bitfield id="FIFO1B4IFG" description="Clears FIFO1B4IFG in RIS register" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="RIS bit corresponding to FIFO1B4IFG is cleared"/>
            </bitfield>
            <bitfield id="FIFO1B2IFG" description="Clears FIFO1B2IFG in RIS register" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="RIS bit corresponding to FIFO1B2IFG is cleared"/>
            </bitfield>
            <bitfield id="FIFO3B4IFG" description="Clears FIFO3B4IFG in RIS register" begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="RIS bit corresponding to FIFO3B4IFG is cleared"/>
            </bitfield>
            <bitfield id="FIFOFULLIFG" description="Clears FIFOFULLIFG in RIS register" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="RIS bit corresponding to FIFOFULLIFG is cleared"/>
            </bitfield>
            <bitfield id="FIFOURUNIFG" description="Clears FIFOURUNIFG in RIS register" begin="13" end="13" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="RIS bit corresponding to FIFOURUNIFG is cleared"/>
            </bitfield>
            <bitfield id="DMADONEIFG" description="Clears DMADONEIFG in RIS register" begin="14" end="14" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="RIS bit corresponding to DMADONEIFG is cleared"/>
            </bitfield>
        </register>
        </group>
    <group id="DAC0_GEN_EVENT" name="DAC0_GEN_EVENT" instances="1" offset="0x1050" instaddr="0x30" description="">
        <register id="DAC0_GEN_EVENT_IIDX" width="32" offset="0x0" description="Interrupt index">
            <bitfield id="STAT" description="Interrupt index status" begin="3" end="0" width="4" rwaccess="R">
                <bitenum id="NO_INTR" value="0x0" description="No pending interrupt"/>
                <bitenum id="MODRDYIFG" value="0x2" description="Module ready interrupt"/>
                <bitenum id="FIFOFULLIFG" value="0x9" description="FIFO full interrupt"/>
                <bitenum id="FIFO1B4IFG" value="0xA" description="FIFO one fourth empty interrupt"/>
                <bitenum id="FIFO1B2IFG" value="0xB" description="FIFO half empty interrupt"/>
                <bitenum id="FIFO3B4IFG" value="0xC" description="FIFO three fourth empty interrupt"/>
                <bitenum id="FIFOEMPTYIFG" value="0xD" description="FIFO empty interrupt"/>
                <bitenum id="FIFOURUNIFG" value="0xE" description="FIFO underrun interrupt"/>
                <bitenum id="DMADONEIFG" value="0xF" description="DMA done interrupt"/>
            </bitfield>
        </register>
        <register id="DAC0_GEN_EVENT_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="MODRDYIFG" description="Masks MODRDYIFG" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt is masked out"/>
                <bitenum id="SET" value="0x1" description="Interrupt will request an interrupt service routine and corresponding bit in MIS will be set"/>
            </bitfield>
            <bitfield id="FIFO1B2IFG" description="Masks FIFO1B2IFG" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt is masked out"/>
                <bitenum id="SET" value="0x1" description="Interrupt will request an interrupt service routine and corresponding bit in MIS will be set"/>
            </bitfield>
            <bitfield id="FIFOEMPTYIFG" description="Masks FIFOEMPTYIFG" begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt is masked out"/>
                <bitenum id="SET" value="0x1" description="Interrupt will request an interrupt service routine and corresponding bit in MIS will be set"/>
            </bitfield>
            <bitfield id="FIFO1B4IFG" description="Masks FIFO1B4IFG" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt is masked out"/>
                <bitenum id="SET" value="0x1" description="Interrupt will request an interrupt service routine and corresponding bit in MIS will be set"/>
            </bitfield>
            <bitfield id="FIFO3B4IFG" description="Masks FIFO3B4IFG" begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt is masked out"/>
                <bitenum id="SET" value="0x1" description="Interrupt will request an interrupt service routine and corresponding bit in MIS will be set"/>
            </bitfield>
            <bitfield id="FIFOFULLIFG" description="Masks FIFOFULLIFG" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt is masked out"/>
                <bitenum id="SET" value="0x1" description="Interrupt will request an interrupt service routine and corresponding bit in MIS will be set"/>
            </bitfield>
            <bitfield id="FIFOURUNIFG" description="Masks FIFOURUNIFG" begin="13" end="13" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt is masked out"/>
                <bitenum id="SET" value="0x1" description="Interrupt will request an interrupt service routine and corresponding bit in MIS will be set"/>
            </bitfield>
            <bitfield id="DMADONEIFG" description="Masks DMADONEIFG" begin="14" end="14" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt is masked out"/>
                <bitenum id="SET" value="0x1" description="Interrupt will request an interrupt service routine and corresponding bit in MIS will be set"/>
            </bitfield>
        </register>
        <register id="DAC0_GEN_EVENT_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="MODRDYIFG" description="Raw interrupt status for MODRDYIFG" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DAC module ready event did not occur"/>
                <bitenum id="SET" value="0x1" description="DAC module ready event occurred"/>
            </bitfield>
            <bitfield id="FIFOEMPTYIFG" description="Raw interrupt status for FIFOEMPTYIFG" begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="FIFO empty condition did not occur"/>
                <bitenum id="SET" value="0x1" description="FIFO empty condition occurred"/>
            </bitfield>
            <bitfield id="FIFO1B4IFG" description="Raw interrupt status for FIFO1B4IFG" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="FIFO one fourth empty condition did not occur"/>
                <bitenum id="SET" value="0x1" description="FIFO one fourth empty condition occurred"/>
            </bitfield>
            <bitfield id="FIFO1B2IFG" description="Raw interrupt status for FIFO1B2IFG" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="FIFO half empty condition did not occur"/>
                <bitenum id="SET" value="0x1" description="FIFO half empty condition occurred"/>
            </bitfield>
            <bitfield id="FIFO3B4IFG" description="Raw interrupt status for FIFO3B4IFG" begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="FIFO three fourth empty condition did not occur"/>
                <bitenum id="SET" value="0x1" description="FIFO three fourth empty condition occurred"/>
            </bitfield>
            <bitfield id="FIFOFULLIFG" description="Raw interrupt status for FIFOFULLIFG" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="FIFO full condition did not occur"/>
                <bitenum id="SET" value="0x1" description="FIFO full condition occurred"/>
            </bitfield>
            <bitfield id="FIFOURUNIFG" description="Raw interrupt status for FIFOURUNIFG" begin="13" end="13" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="FIFO underrun condition did not occur"/>
                <bitenum id="SET" value="0x1" description="FIFO underrun condition occurred"/>
            </bitfield>
            <bitfield id="DMADONEIFG" description="Raw interrupt status for DMADONEIFG" begin="14" end="14" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DMA done condition did not occur"/>
                <bitenum id="SET" value="0x1" description="DMA done condition occurred"/>
            </bitfield>
        </register>
