dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/DAC0_1.0.xml
        <register id="DAC0_GEN_EVENT_MIS" width="32" offset="0x18" description="Masked interrupt status">
            <bitfield id="MODRDYIFG" description="Masked interrupt status for MODRDYIFG" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="MODRDYIFG does not request an interrupt service routine"/>
                <bitenum id="SET" value="0x1" description="MODRDYIFG requests an interrupt service routine"/>
            </bitfield>
            <bitfield id="FIFOEMPTYIFG" description="Masked interrupt status for FIFOEMPTYIFG" begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="FIFOEMPTYIFG does not request an interrupt service routine"/>
                <bitenum id="SET" value="0x1" description="FIFOEMPTYIFG requests an interrupt service routine"/>
            </bitfield>
            <bitfield id="FIFO1B4IFG" description="Masked interrupt status for FIFO1B4IFG" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="FIFO1B4IFG does not request an interrupt service routine"/>
                <bitenum id="SET" value="0x1" description="FIFO1B4IFG requests an interrupt service routine"/>
            </bitfield>
            <bitfield id="FIFO1B2IFG" description="Masked interrupt status for FIFO1B2IFG" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="FIFO1B2IFG does not request an interrupt service routine"/>
                <bitenum id="SET" value="0x1" description="FIFO1B2IFG requests an interrupt service routine"/>
            </bitfield>
            <bitfield id="FIFO3B4IFG" description="Masked interrupt status for FIFO3B4IFG" begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="FIFO3B4IFG does not request an interrupt service routine"/>
                <bitenum id="SET" value="0x1" description="FIFO3B4IFG requests an interrupt service routine"/>
            </bitfield>
            <bitfield id="FIFOFULLIFG" description="Masked interrupt status for FIFOFULLIFG" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="FIFOFULLIFG does not request an interrupt service routine"/>
                <bitenum id="SET" value="0x1" description="FIFOFULLIFG requests an interrupt service routine"/>
            </bitfield>
            <bitfield id="FIFOURUNIFG" description="Masked interrupt status for FIFOURUNIFG" begin="13" end="13" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="FIFOURUNIFG does not request an interrupt service routine"/>
                <bitenum id="SET" value="0x1" description="FIFOURUNIFG requests an interrupt service routine"/>
            </bitfield>
            <bitfield id="DMADONEIFG" description="Masked interrupt status for DMADONEIFG" begin="14" end="14" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DMADONEIFG does not request an interrupt service routine"/>
                <bitenum id="SET" value="0x1" description="DMADONEIFG requests an interrupt service routine"/>
            </bitfield>
        </register>
        <register id="DAC0_GEN_EVENT_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="MODRDYIFG" description="Sets MODRDYIFG in RIS register" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="RIS bit corresponding to MODRDYIFG is set"/>
            </bitfield>
            <bitfield id="FIFOEMPTYIFG" description="Sets FIFOEMPTYIFG in RIS register" begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="RIS bit corresponding to FIFOEMPTYIFG is set"/>
            </bitfield>
            <bitfield id="FIFO1B4IFG" description="Sets FIFO1B4IFG in RIS register" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="RIS bit corresponding to FIFO1B4IFG is set"/>
            </bitfield>
            <bitfield id="FIFO1B2IFG" description="Sets FIFO1B2IFG in RIS register" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="RIS bit corresponding to FIFO1B2IFG is set"/>
            </bitfield>
            <bitfield id="FIFO3B4IFG" description="Sets FIFO3B4IFG in RIS register" begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="RIS bit corresponding to FIFO3B4IFG is set"/>
            </bitfield>
            <bitfield id="FIFOFULLIFG" description="Sets FIFOFULLIFG in RIS register" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="RIS bit corresponding to FIFOFULLIFG is set"/>
            </bitfield>
            <bitfield id="FIFOURUNIFG" description="Sets FIFOURUNIFG in RIS register" begin="13" end="13" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="RIS bit corresponding to FIFOURUNIFG is set"/>
            </bitfield>
            <bitfield id="DMADONEIFG" description="Sets DMADONEIFG in RIS register" begin="14" end="14" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="RIS bit corresponding to DMADONEIFG is set"/>
            </bitfield>
        </register>
        <register id="DAC0_GEN_EVENT_ICLR" width="32" offset="0x28" description="Interrupt clear">
            <bitfield id="MODRDYIFG" description="Clears MODRDYIFG in RIS register" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="RIS bit corresponding to MODRDYIFG is cleared"/>
            </bitfield>
            <bitfield id="FIFOEMPTYIFG" description="Clears FIFOEMPTYIFG in RIS register" begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="RIS bit corresponding to FIFOEMPTYIFG is cleared"/>
            </bitfield>
            <bitfield id="FIFO1B4IFG" description="Clears FIFO1B4IFG in RIS register" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="RIS bit corresponding to FIFO1B4IFG is cleared"/>
            </bitfield>
            <bitfield id="FIFO1B2IFG" description="Clears FIFO1B2IFG in RIS register" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="RIS bit corresponding to FIFO1B2IFG is cleared"/>
            </bitfield>
            <bitfield id="FIFO3B4IFG" description="Clears FIFO3B4IFG in RIS register" begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="RIS bit corresponding to FIFO3B4IFG is cleared"/>
            </bitfield>
            <bitfield id="FIFOFULLIFG" description="Clears FIFOFULLIFG in RIS register" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="RIS bit corresponding to FIFOFULLIFG is cleared"/>
            </bitfield>
            <bitfield id="FIFOURUNIFG" description="Clears FIFOURUNIFG in RIS register" begin="13" end="13" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="RIS bit corresponding to FIFOURUNIFG is cleared"/>
            </bitfield>
            <bitfield id="DMADONEIFG" description="Clears DMADONEIFG in RIS register" begin="14" end="14" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="RIS bit corresponding to DMADONEIFG is cleared"/>
            </bitfield>
        </register>
