dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/DAC0_1.0.xml
        </group>
    <register id="DAC0_EVT_MODE" width="32" offset="0x10E0" description="Event Mode">
        <bitfield id="INT0_CFG" description="Event line mode select for event corresponding to [IPSTANDARD.CPU_INT]" begin="1" end="0" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="Event handled by software. Software must clear the associated RIS flag."/>
            <bitenum id="HARDWARE" value="0x2" description="Event handled by hardware. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
        <bitfield id="EVT1_CFG" description="Event line mode select for event corresponding to [IPSTANDARD.GEN_EVENT]" begin="3" end="2" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="Event handled by software. Software must clear the associated RIS flag."/>
            <bitenum id="HARDWARE" value="0x2" description="Event handled by hardware. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
    </register>
    <register id="DAC0_DESC" width="32" offset="0x10FC" description="Module Description">
        <bitfield id="MINREV" description="Minor rev of the IP" begin="3" end="0" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="MAJREV" description="Major rev of the IP" begin="7" end="4" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="FEATUREVER" description="Feature Set for the module *instance*" begin="15" end="12" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="MODULEID" description="Module identification contains a unique peripheral identification number. The assignments are maintained in a central database for all of the platform modules to ensure uniqueness." begin="31" end="16" width="16" rwaccess="R">
        </bitfield>
    </register>
    <register id="DAC0_CTL0" width="32" offset="0x1100" description="Control 0">
        <bitfield id="DFM" description="This bit defines the DAC input data format." begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="BINARY" value="0x0" description="Straight binary"/>
            <bitenum id="TWOS_COMP" value="0x1" description="Twos complement"/>
        </bitfield>
        <bitfield id="ENABLE" description="This bit enables the DAC module." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="CLR" value="0x0" description="DAC is disabled"/>
            <bitenum id="SET" value="0x1" description="DAC is enabled"/>
        </bitfield>
        <bitfield id="RES" description="These bits define the DAC output voltage resolution." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="_8BITS" value="0x0" description="8-bits resolution"/>
            <bitenum id="_12BITS" value="0x1" description="12-bit resolution"/>
        </bitfield>
    </register>
    <register id="DAC0_CTL1" width="32" offset="0x1110" description="Control 1">
        <bitfield id="AMPEN" description="AMP_EN - output amplifier enabled or disabled
0 : disabled 
1 : enabled" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="disable"/>
            <bitenum id="ENABLE" value="0x1" description="enable"/>
        </bitfield>
        <bitfield id="REFSP" description="This bit selects the DAC voltage reference source + input." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="VDDA" value="0x0" description="Analog supply (VDDA) as VR+"/>
            <bitenum id="VEREFP" value="0x1" description="VEREFP pin as VR+"/>
        </bitfield>
        <bitfield id="OPS" description="These bits select the DAC output on device pin." begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="NOC0" value="0x0" description="No connect. Both DAC output switches are open."/>
            <bitenum id="OUT0" value="0x1" description="OUT0 output is selected"/>
        </bitfield>
        <bitfield id="REFSN" description="This bit selects the DAC voltage reference source + input." begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="VEREFN" value="0x0" description="VEREFN pin as VR-"/>
            <bitenum id="VSSA" value="0x1" description="Analog supply (VSSA) as VR-"/>
        </bitfield>
        <bitfield id="AMPHIZ" description="AMPHIZ - amplifier output value

0 : amplifier output is high impedance
1 : amplifier output is pulled down to ground" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="HIZ" value="0x0" description="HiZ when disable"/>
            <bitenum id="PULLDOWN" value="0x1" description="dacout pulldown when disable"/>
        </bitfield>
    </register>
    <register id="DAC0_CTL2" width="32" offset="0x1120" description="Control 2">
        <bitfield id="FIFOEN" description="This bit enables the FIFO and the FIFO hardware control state machine." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="CLR" value="0x0" description="FIFO is disabled"/>
            <bitenum id="SET" value="0x1" description="FIFO is enabled"/>
        </bitfield>
        <bitfield id="FIFOTH" description="These bits determine the FIFO threshold. In case of DMA based operation, DAC generates new DMA trigger when the number of empty locations in FIFO match the selected FIFO threshold level. 
In case of CPU based operation, the FIFO threshold bits are don't care and FIFO level is directly indicated through the respective bits in the RIS register." begin="9" end="8" width="2" rwaccess="R/W">
            <bitenum id="LOW" value="0x0" description="One fourth of the FIFO locations are empty"/>
            <bitenum id="MED" value="0x1" description="Half of the FIFO locations are empty"/>
            <bitenum id="HIGH" value="0x2" description="Three fourth of the FIFO locations are empty"/>
            <bitenum id="SPARE" value="0x3" description="Reserved value. Defaults to same effect as FIFOTH = 0 (One fourth of the FIFO locations are empty)."/>
        </bitfield>
        <bitfield id="FIFOTRIGSEL" description="These bits select the source for FIFO read trigger. When the selected FIFO read trigger is asserted, the data from FIFO (as indicated by read pointer) is moved into internal DAC data register." begin="17" end="16" width="2" rwaccess="R/W">
            <bitenum id="STIM" value="0x0" description="Sample time generator output"/>
            <bitenum id="TRIG0" value="0x1" description="Hardware trigger-0 from event fabric"/>
            <bitenum id="SPARE1" value="0x2" description="Reserved - unimplemented"/>
            <bitenum id="SPARE2" value="0x3" description="Reserved - unimplemented"/>
        </bitfield>
        <bitfield id="DMATRIGEN" description="This bit enables the DMA trigger generation mechanism. When this bit is set along with FIFOEN, the DMA trigger is generated based on the empty FIFO locations qualified by FIFOTH settings. This bit should be cleared by software to stop further DMA triggers." begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="CLR" value="0x0" description="DMA trigger generation mechanism is disabled"/>
            <bitenum id="SET" value="0x1" description="DMA trigger generation mechanism is enabled"/>
        </bitfield>
    </register>
    <register id="DAC0_CTL3" width="32" offset="0x1130" description="Control 3">
        <bitfield id="STIMEN" description="This bit enables the sample time generator." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="CLR" value="0x0" description="Sample time generator is disabled"/>
            <bitenum id="SET" value="0x1" description="Sample time generator is enabled"/>
        </bitfield>
        <bitfield id="STIMCONFIG" description="These bits are used to configure the trigger rate from the sample time generator.
The STIMCONFIG values 10 to 15 are reserved and default to same effect as value 0 (500SPS)." begin="11" end="8" width="4" rwaccess="R/W">
            <bitenum id="_500SPS" value="0x0" description="Trigger rate is 500 sps (clock divide value is 4000)"/>
            <bitenum id="_1KSPS" value="0x1" description="Trigger rate is 1 ksps (clock divide value is 2000)"/>
            <bitenum id="_2KSPS" value="0x2" description="Trigger rate is 2 ksps (clock divide value is 1000)"/>
            <bitenum id="_4KSPS" value="0x3" description="Trigger rate is 4 ksps (clock divide value is 500)"/>
            <bitenum id="_8KSPS" value="0x4" description="Trigger rate is 8 ksps (clock divide value is 250)"/>
            <bitenum id="_16KSPS" value="0x5" description="Trigger rate is 16 ksps (clock divide value is 125)"/>
            <bitenum id="_100KSPS" value="0x6" description="Trigger rate is 100 ksps (clock divide value is 20)"/>
            <bitenum id="_200KSPS" value="0x7" description="Trigger rate is 200 ksps (clock divide value is 10)"/>
            <bitenum id="_500KSPS" value="0x8" description="Trigger rate is 500 ksps (clock divide value is 4)"/>
            <bitenum id="_1MSPS" value="0x9" description="Trigger rate is 1 Msps (clock divide value is 2)"/>
        </bitfield>
    </register>
    <register id="DAC0_CALCTL" width="32" offset="0x1140" description="Calibration control">
        <bitfield id="CALON" description="This bit when set initiates the DAC offset error calibration sequence and is automatically reset when the offset error calibration completes." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="INACTIVE" value="0x0" description="Offset error calibration is not active"/>
            <bitenum id="ACTIVE" value="0x1" description="Initiate offset error calibration or offset error calibration is already in progress"/>
        </bitfield>
        <bitfield id="CALSEL" description="This bit is used to select between factory trim or self calibration trim." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="FACTORYTRIM" value="0x0" description="Factory Trim Calibration Values are used when calibration is enabled"/>
            <bitenum id="SELFCALIBRATIONTRIM" value="0x1" description="Self Calibration Trim Values are used when calibration is enabled"/>
        </bitfield>
    </register>
    <register id="DAC0_CALDATA" width="32" offset="0x1160" description="Calibration data">
        <bitfield id="DATA" description="DAC offset error calibration data. The DAC offset error calibration data is represented in twos complement format providing a range of 64 to +63.
This is read-only bit, reflecting the calibration data. Writing to this register will have no effect, it will not change the calibration value." begin="6" end="0" width="7" rwaccess="R">
        </bitfield>
    </register>
    <register id="DAC0_DATA0" width="32" offset="0x1200" description="Data 0">
        <bitfield id="DATA_VALUE" description="This is the data written for digital to analog conversion." begin="11" end="0" width="12" rwaccess="R/W">
        </bitfield>
    </register>

</module>